//анімація менюшки
$(window).scroll(function () {

    if ($(window).scrollTop() == 0) {
        $(".menuLogo").animate({height: "40px", width: '40px'}, 1000);
        $(".menuHolder").animate({height: "50px"}, 1000);
    }
    if ($(window).scrollTop() >= 10) {
        $('.menuLogo').css('width', '30px').css('height', '30px');
        $('.menuHolder').css('height', '40px');
    }
});
//кінець анімації менюшки
//при певній координаті зникає текст "на початок"
$(window).scroll(function () {
    if ($(window).scrollTop() < 550) {
        $('#start').fadeOut(500);
    }
    ;
    if ($(window).scrollTop() >= 550) {
        $('#start').fadeIn(500);
    }
});

//початок паралакса
$(window).scroll(function (e) {
    parallaxScroll();
});
function parallaxScroll() {
    var scrolled = $(window).scrollTop();
    $('.parallax_honey_img_1').css('top', (0 - (scrolled * .15)) + 'px');
    $('.parallax_honey_img_2').css('top', (0 - (scrolled * .5)) + 'px');


};
//кінець паралакса


//модальне вікно 'види меду'
$(window).ready(function () {
    $('.nav_container_hony').click(function () {
        $('.container_modal_window').fadeIn();
        //заборона прокрутки
        document.onmousewheel = document.onwheel = function () {
            return false;
        };
    });
    $('.container_modal_window,.modal_window').click(function () {
        $('.container_modal_window').fadeOut();
        //прокрутка дозволяється
        document.onmousewheel = document.onwheel = function () {
            return true;
        };
    });
});
//кінець модальне вікно 'види меду'


//логіка модального вікна
//логіка переїхала в файл admin.js
//кінець логіка модального вікна

$(document).ready(function () {
    $(".menu").on("click", "a", function (event) {
        event.preventDefault();
        var id = $(this).attr('href'),
            top = $(id).offset().top;
        $('body,html').animate({scrollTop: top - 45}, 1000);
    });
    return false;
});
//tooltips


//bee products
$(document).ready(function () {



$( "#button_bee-products_on" ).click(function() {
    $(".title_bee-products" )
        .text("ПИЛОК").css( {'fontSize':'4vw','left':'-100%'}).stop().animate({left:"1px"} );
    $(".description_bee-products" )
        .text("Пилок - це засіб для лікування та" +
            "профілактики багатьох захворювань і , крім того, сильний біологічний стимулятор ." +
            "Він містить незамінні вітаміни , більша частина яких не виробляється організмом" +
            "людини , і повинна надходити із зовнішнього середовища. Завдяки цим речовинам ," +
            "пилок має протизапальні , сечогінні , жовчогінні , капіляропідкріплюючі і" +
            "протипухлинні властивості. Але найважливішим є вміст в пилку фітонцидів, які захищають рослини від" +
            "вірусів, бактерій і грибків. Бджолине обніжжя надає більш повний вплив на" +
            "людський організм, ніж синтетичні вітамінні препарати. Це живий, природний" +
            "продукт, що не проходить додаткової обробки і не втрачає при цьому своїх" +
            "корисних властивостей і біологічно активних речовин.")
             .css( 'top','-100%'  ).stop().animate({top:"1px"} );


});
    $( "#button_bee-products_two" ).click(function() {
        $(".title_bee-products" ).text("ПЕРГА").css( {'fontSize':'4.5vw','left':'-100%'}).stop().animate({left:"1px"});

        $(".description_bee-products" ).text("До складу перги входять: білки; 16 амінокислот; 13 жирних амінокислот;" +
            "вуглеводи, вітаміни (A, C, P, E, B1, B2, B6, D та ін); ензими; мінеральні речовини" +
            "(калій, магній, залізо, кальцій , цинк, натрій тощо).Пергу застосовують для лікування " +
            "цілого спектру захворювань – анемії,серцевої недостатності, інфарктів, інсультів, гепатитів, " +
            "виразок шлунку, гастритів,порушення потенції, чоловічого безпліддя, патології вагітних," +
            " гінекологічних захворювань. Бджолиний хліб відновлює кровообіг мозку при черепно-мозкових" +
            "травмах та інсультах, розсмоктує доброякісні пухлини (міома, фіброма)." +
            "Найчастіше пергу застосовують для підвищення імунітету організму як у дітей так і дорослих." +
            "Перга є профілактичним засобом по запобіганню інфекційних захворювань" +
            ". За мікробіологічним складом бджолиний хліб немає аналогів – за короткий" +
            "час відновлює травлення, лікуєдисбактеріоз. Перга сприяє утворенню нових" +
            " клітин в організмі, тобто проходитьомолодження організму в цілому, швидше загоюються рани.")
            .css( 'top','-100%'  ).stop().animate({top:"-5px"} );

    });
    $( "#button_bee-products_three" ).click(function() {
        $(".title_bee-products").text("ПРОПОЛІС").css({'fontSize':'3vw','left': '-100%'}).stop().animate({left: "-8px"})


            $(".description_bee-products").text("Прополіс - це природна запашна речовина на основі смол рослинного" +
        "походження, які бджоли збирають з листя, бруньок,стебел і кори дерев, а також з" +
        "трав і чагарників. Має дуже сильну антимікробну дію. Прополіс і настоянки," +
        "виготовлені на його основі , допоможуть позбутися від будь-яких інфекцій" +
        "порожнини рота і шлунково-кишкового тракту. За допомогою інгаляцій на основі" +
        "препаратів прополісу лікуються запалення дихальних шляхів. Широко" +
        "використовується він і в народній медицині для лікування запальних процесів та" +
        "інфекційних захворювань , а також для виготовлення різних препаратів. Прополіс -" +
        "це універсальний і дуже зручний у використанні лікувальний засіб." +
        "Разом із цим, прополіс – надзвичайно сильний знеболювач. За силою дії він" +
        "перевищує новокаїн у 5 разів. Він містить до 30% фенольних сполук, які" +
        "запобігають старінню, онкологічним захворюванням. Прополіс ефективний при" +
        "лікуванні аденоми простати, геморою, простатиту та багатьох інших хвороб.")
            .css( 'top','-100%'  ).stop().animate({top:"-10px"});



    });
    $( "#button_bee-products_four" ).click(function() {
        $(".title_bee-products").text("ЗАБРУС").css({'fontSize':'3.7vw','left':'-100%'}).stop().animate({left: "0px"})

        $(".description_bee-products").text("Забрус - це кришечки з воску, якими бджоли запечатують стільники після" +
            "дозрівання меду. Цей продукт дуже корисний, тому що при виготовленні кришечок" +
            "бджоли додають у віск пилок і прополіс, який дезінфікує і зберігає запечатаний мед." +
            "Крім того, забрус містить фермент лізоцим, який дає антибактеріальний захист." +
            "При жуванні забрусу в порожнині рота" +
            "підвищується його температура, що сприяє виділенню ефірних масел прополісу, які," +
            "піднімаючись в порожнину носоглотки, знімають запалення зі слизової оболонки." +
            "Відомі навіть випадки , коли жування забрусу протягом декількох днів рятувало від" +
            "необхідності проколювання, виліковувались тривалі запальні процеси при гострих" +
            "формах гаймориту. У людини, котра регулярно вживає забрус, спостерігається" +
            "поліпшення слиновиділення , підвищення секреторної і рухової функції шлунка.")
            .css( 'top','-100%'  ).stop().animate({top:"1px"});


    });
    $( "#button_bee-products_five" ).click(function() {
        $(".title_bee-products").text("ВІСК").css({'fontSize':'4vw','left': '-100%'}).stop().animate({left: "40px"})

        $(".description_bee-products").text("Лікувальні властивості віском вже доведено медициною, тому його застосовують " +
            "при стоматиті, захворюваннях ясен, болі в зубах, лікування завжди є результативним. " +
            "За рахунок пластичності речовини, його легко розжовувати, таким чином, " +
            "відбувається масаж ясен, язика і поліпшується стан зубної емалі, освіжається дихання." +
            " Допомагає зупинити запалення лікування воском при таких захворюваннях, як фарингіт, гайморит, " +
            "тонзиліт, його потрібно жувати до 10 хвилин до 6 разів на день.")
            .css( 'top','-100%'  ).stop().animate({top:"20px"});


    });
    $( "#button_bee-products_six" ).click(function() {
        $(".title_bee-products").text("ВОСКОВА МІЛЬ").css({'fontSize':'2vw','left': '-100%'}).stop().animate({left: "1px"})

        $(".description_bee-products").text("Важлива сторона оздоровлючої дії цієї біологічно активної " +
            "добавки є в її позитивному впливі на обмін речовин: понижується рівень цукру, не відкладаються " +
            "жири в печінці і по стінках кровоносних судин, понижується рівень холестирину. Виявлено антиоксидатну" +
            " дію, яка запобігає стресорному пошкодженню тканин і розвитку атеросклерозу, завдяки чому препарат ефективний" +
            " як кардіопротекторний засіб для профілактики і допоміжного лікування ішемії серця.")
            .css( 'top','-100%').stop().animate({top:"20px"});


    })

});

